#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.foreign_language_reader will be updated in-place
  ~ resource "digitalocean_kubernetes_cluster" "foreign_language_reader" {
        cluster_subnet = "10.244.0.0/16"
        created_at     = "2020-03-15 07:58:25 +0000 UTC"
        endpoint       = "https://9329c2de-f4e2-4f80-be4c-16fefb26477e.k8s.ondigitalocean.com"
        id             = "9329c2de-f4e2-4f80-be4c-16fefb26477e"
        ipv4_address   = "138.197.199.67"
        kube_config    = (sensitive value)
        name           = "foreign-language-reader"
        region         = "sfo2"
        service_subnet = "10.245.0.0/16"
        status         = "running"
        tags           = [
            "prod",
        ]
        updated_at     = "2020-03-29 06:00:17 +0000 UTC"
        version        = "1.16.6-do.2"

      ~ node_pool {
            actual_node_count = 4
            auto_scale        = true
            id                = "526d45ba-e14f-437e-883e-54bcf648a21f"
            labels            = {}
          ~ max_nodes         = 5 -> 6
            min_nodes         = 1
            name              = "worker-pool"
            node_count        = 0
            nodes             = [
                {
                    created_at = "2020-03-21 22:17:49 +0000 UTC"
                    droplet_id = "185707694"
                    id         = "2ee566c0-2957-4e77-abb1-c5e9ddc8bfaa"
                    name       = "worker-pool-ztyu"
                    status     = "running"
                    updated_at = "2020-03-21 22:19:09 +0000 UTC"
                },
                {
                    created_at = "2020-03-21 22:17:49 +0000 UTC"
                    droplet_id = "185707693"
                    id         = "14dd9710-576e-4ee0-8964-4aa27ae062a8"
                    name       = "worker-pool-ztyc"
                    status     = "running"
                    updated_at = "2020-03-21 22:19:09 +0000 UTC"
                },
                {
                    created_at = "2020-03-21 22:25:29 +0000 UTC"
                    droplet_id = "185708224"
                    id         = "61f51359-a05f-4ee0-af3d-7369aed110f0"
                    name       = "worker-pool-ztxu"
                    status     = "running"
                    updated_at = "2020-03-21 22:26:50 +0000 UTC"
                },
                {
                    created_at = "2020-03-25 04:23:20 +0000 UTC"
                    droplet_id = "186082569"
                    id         = "b1564256-75fc-4833-b376-58264269a083"
                    name       = "worker-pool-z9lz"
                    status     = "running"
                    updated_at = "2020-03-25 04:24:39 +0000 UTC"
                },
            ]
            size              = "s-2vcpu-4gb"
            tags              = []
        }
    }

  # module.infrastructure.module.monitoring.helm_release.metrics_server will be created
  + resource "helm_release" "metrics_server" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.10.1"
      + wait                       = true
    }

  # module.infrastructure.module.monitoring.kubernetes_namespace.monitoring will be created
  + resource "kubernetes_namespace" "monitoring" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "monitoring"
            }
          + generation       = (known after apply)
          + name             = "monitoring"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
